{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задание 1\n",
    "\n",
    "Напишите программу, которая по данному числу n от 1 до 9 выводит на экран n пингвинов. Изображение одного пингвина имеет размер 5 × 9 символов, между двумя соседними пингвинами также имеется пустой (из пробелов) столбец"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def penguin(n):\n",
    "    n = int(n)\n",
    "    hat = n * \"   _~_   \"\n",
    "    eyes = \"  (o o)  \" * n\n",
    "    body = \" /  V  \\ \" * n\n",
    "    body2 = \"/(  _  )\\\\\" * n\n",
    "    leg = \"  ^^ ^^  \" * n\n",
    "    print(hat)\n",
    "    print(eyes)\n",
    "    print(body)\n",
    "    print(body2)\n",
    "    print(leg)\n",
    "   \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "9\n",
      "   _~_      _~_      _~_      _~_      _~_      _~_      _~_      _~_      _~_   \n",
      "  (o o)    (o o)    (o o)    (o o)    (o o)    (o o)    (o o)    (o o)    (o o)  \n",
      " /  V  \\  /  V  \\  /  V  \\  /  V  \\  /  V  \\  /  V  \\  /  V  \\  /  V  \\  /  V  \\ \n",
      "/(  _  )\\/(  _  )\\/(  _  )\\/(  _  )\\/(  _  )\\/(  _  )\\/(  _  )\\/(  _  )\\/(  _  )\\\n",
      "  ^^ ^^    ^^ ^^    ^^ ^^    ^^ ^^    ^^ ^^    ^^ ^^    ^^ ^^    ^^ ^^    ^^ ^^  \n"
     ]
    }
   ],
   "source": [
    "penguin(input())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "### Задание 2 \n",
    "Возьмите строку, состоящую из нескольких слов, разделенных пробелами. Программа должна напечатать количество слов. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "193\n"
     ]
    }
   ],
   "source": [
    "tolstoy_longest_sentence = \"В 1800-х годах, в те времена, когда не было еще ни железных, ни шоссейных дорог, ни газового, ни стеаринового света, ни пружинных низких диванов, ни мебели без лаку, ни разочарованных юношей со стеклышками, ни либеральных философов-женщин, ни милых дам-камелий, которых так много развелось в наше время, - в те наивные времена, когда из Москвы, выезжая в Петербург в повозке или карете, брали с собой целую кухню домашнего приготовления, ехали восемь суток по мягкой, пыльной или грязной дороге и верили в пожарские котлеты, в валдайские колокольчики и бублики, - когда в длинные осенние вечера нагорали сальные свечи, освещая семейные кружки из двадцати и тридцати человек, на балах в канделябры вставлялись восковые и спермацетовые свечи, когда мебель ставили симметрично, когда наши отцы были еще молоды не одним отсутствием морщин и седых волос, а стрелялись за женщин и из другого угла комнаты бросались поднимать нечаянно и не нечаянно уроненные платочки, наши матери носили коротенькие талии и огромные рукава и решали семейные дела выниманием билетиков, когда прелестные дамы-камелии прятались от дневного света, - в наивные времена масонских лож, мартинистов, тугендбунда, во времена Милорадовичей, Давыдовых, Пушкиных, - в губернском городе К. был съезд помещиков, и кончались дворянские выборы.\"\n",
    "words = tolstoy_longest_sentence.split()\n",
    "print(len(words))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
